# Дана строка. Замените в этой строке все цифры 1 на слово one

s = '1 + 1 = two'

print(s.replace('1', 'one'))
