# Дана строка, состоящая ровно из двух слов, разделенных пробелом.
# Переставьте эти слова местами.
# Результат запишите в строку и выведите получившуюся строку.

s = 'come on'

print(f'{s.split()[1]} {s.split()[0]}')
